Revit 2026 API

# XYZBasisZ Property

---

The basis of the Z axis.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ BasisZ { get; }
```
```vb
Public Shared ReadOnly Property BasisZ As XYZ
	Get
```
```cpp
public:
static property XYZ^ BasisZ {
	XYZ^ get ();
}
```
```fsharp
static member BasisZ : XYZ with get
```

#### Property Value

XYZ

The basis of the Z axis is the vector (0,0,1), the unit vector on the Z axis.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace